cmsis-svd/cmsis-svd/data/Spansion/MB9AF13xK_svd.xml
        <!-- REGISTER "STB_CTL" -->
        <register>
          <name>STB_CTL</name>
          <description>Standby Mode Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0017</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "KEY" -->
            <field>
              <name>KEY</name>
              <description>Standby mode control write control bit </description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPL" -->
            <field>
              <name>SPL</name>
              <description>Standby pin level setting bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSTM" -->
            <field>
              <name>DSTM</name>
              <description>Deep standby mode select bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STM" -->
            <field>
              <name>STM</name>
              <description>Standby mode selection bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSV_CTL" -->
        <register>
          <name>CSV_CTL</name>
          <description>CSV control register</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x7003</resetValue>
          <resetMask>0x7303</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCD" -->
            <field>
              <name>FCD</name>
              <description>FCS count cycle setting bits</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCSRE" -->
            <field>
              <name>FCSRE</name>
              <description>FCS reset output enable bit </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCSDE" -->
            <field>
              <name>FCSDE</name>
              <description>FCS function enable bit </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCSVE" -->
            <field>
              <name>SCSVE</name>
              <description>Sub CSV function enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCSVE" -->
            <field>
              <name>MCSVE</name>
              <description>Main CSV function enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSV_STR" -->
        <register>
          <name>CSV_STR</name>
          <description>CSV status register</description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCMF" -->
            <field>
              <name>SCMF</name>
              <description>Sub clock failure detection flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MCMF" -->
            <field>
              <name>MCMF</name>
              <description>Main clock failure detection flag </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FCSWH_CTL" -->
        <register>
          <name>FCSWH_CTL</name>
          <description>Frequency detection window setting register</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "FCSWL_CTL" -->
        <register>
          <name>FCSWL_CTL</name>
          <description>Frequency detection window setting register</description>
          <addressOffset>0x4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "FCSWD_CTL" -->
        <register>
          <name>FCSWD_CTL</name>
          <description>Frequency detection counter register</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CRTRIM" -->
    <peripheral>
      <name>CRTRIM</name>
      <description>CR Trimming Registers</description>
      <groupName>CRTRIM</groupName>
      <baseAddress>0x4002E000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MCR_PSR" -->
        <register>
          <name>MCR_PSR</name>
          <description>High-speed CR oscillation Frequency Division Setup Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSR" -->
            <field>
              <name>CSR</name>
              <description>High-speed CR oscillation frequency division ratio setting bits</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR_FTRM" -->
        <register>
          <name>MCR_FTRM</name>
          <description>High-speed CR oscillation Frequency Trimming Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0180</resetValue>
          <resetMask>0x03FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRD" -->
            <field>
              <name>TRD</name>
              <description>Frequency trimming setup bits</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR_RLR" -->
        <register>
          <name>MCR_RLR</name>
          <description>High-Speed CR Oscillation Register Write-Protect Register </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRMLCK" -->
            <field>
              <name>TRMLCK</name>
              <description>Register write-protect bits</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
